__test__/load-test.yml
config:
  target: "https://translators24.com/"
  phases:
    - duration: 20
      arrivalRate: 1
      maxVuser: 5

scenarios:
  - name: "Emit an event"
    engine: socketio
    flow:
      - emit:
          - "connectAiChat" # your channel
      - think: 4
      - emit:
          channel: "clientMessage"
          data:
            message: "say this is a test"

      - think: 5